// * 1 создание переменной
var number; //var - создание переменной
number = 5; //установка значения


var num = 5;// 2 упрощённый вариант
num = 7; // меняем значение переменной


//действия с переменными
console.log("Переменная: " + num + "."); //выведем эту переменную во
// внутрь консоли

//3 создание константы
const Num = 10 //оздание константы
//данное значение нельзя переопределять
console.log("Константа: " + Num + ".");//выведем эту константу во
// внутрь консоли

/*
несколько существующих типов данных в языке JavaScript:
var some = 1 Integer - целые числа;
var some = 1.12 Float - числа с плавающей точкой;
var some = "Привет" String - строки;
var some = true Boolean - принимают только true или же false.
*/

// let - отличается областью видимости (от var)

param = 2;
let param = 3;
